Repository: 84000/data-translation-memory
Catalog: toh163-v2.tmx
Source language: bo
Languages: en

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་ཞི་བ་མཁས་པའི་གཟི་བརྗིད་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་
en: There resides the thus-gone, worthy, perfect Buddha King Who Is Peaceful and Splendorous in His Learning and Rich in Melody.

source: གཞོན་ནུ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བ་མཁས་པའི་གཟི་བརྗིད་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་དེའི་མཚན་ཐོས་ནས་
en: Young man, when those noble sons or daughters who abide in the Great Vehicle hear the name of the thus-gone one King Who is Peaceful and Splendorous in His Learning and Rich in Melody

source: སོམ་ཉི་མི་ཟ་ལ་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན་དེ་ཚེ་འདས་པའི་འོག་ཏུ་ཀུན་ནས་འོད་ཟེར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར།
en: —as long as they do not doubt this but trust in my vision—they will achieve the absorption called utterly illuminating once they have passed away.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་ཡང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དུ་ཚང་བ་དག་མཐོང་བར་འགྱུར།
en: At the time of death, they will see trillions of buddhas.

source: ཤར་ཕྱོགས་སུ་ཇི་ལྟ་བ་བཞིན་ཕྱོགས་ཐམས་ཅད་དུ་ཡང་དེ་བཞིན་དུ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དུ་ཚང་བ་དག་མཐོང་བར་འགྱུར།
en: In all directions, as in the east, they will see trillions of buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གང་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀུན་དུ་འཛིན་པར་འགྱུར།
en: They will retain all the Dharma teachings given by these blessed buddhas.

source: བྱང་ཆུབ་ལ་ཐུག་གི་བར་དུ་སངས་རྒྱས་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར།
en: Until reaching awakening, they will be blessed by trillions of buddhas.

source: ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུར་འཁོར་བ་ལས་ཕྱིར་ཕྱོགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་རོ། །
en: Such beginning bodhisattvas, having turned from cyclic existence for ninety-nine trillion eons, will reach unsurpassed and perfect awakening.”

source: གང་ཞིག་འཇིག་རྟེན་འདི་ན་སངས་རྒྱས་ཀྱི། །ཡོན་ཏན་རྒྱ་མཚོའི་མཚན་མཆོག་ཐོབ་གྱུར་པ། །
en: “Those in this world who hear the supreme name Of this buddha with an ocean of virtues

source: དེས་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲི་རྣམས་ལ། །མྱུར་དུ་མཆོད་པ་བླ་མེད་རབ་ཏུ་བྱེད། །
en: Will swiftly perform unsurpassed veneration Of one hundred billion buddhas.

source: མཐའ་ཡས་དྲི་མེད་ཁྱད་པར་མཆོད་བྱས་ཤིང་། །སྲིད་པ་ཀུན་ཏུ་སངས་རྒྱས་ཆེ་རྣམས་ཀྱི། །ཉི་མ་མཛད་པའི་སྤྱད་པ་སྤྱོད་ནས་སུ། །
en: “Once they have venerated these limitless beings free from stains, They will engage in the splendorous activity Of the magnificent buddhas in all existences.

source: ཕྱིས་ནི་བྱང་ཆུབ་དྲན་དབང་དེས་རེག་འགྱུར། །
en: Later, they will also reach the perfect insight of awakening.

source: ཇི་ལྟར་གང་གཱའི་བྱེ་སྙེད་རྣམ་པར་འདྲེན། །མང་པོ་དག་ནི་ཚེ་གཅིག་གིས་མཆོད་དེ། །ཀུན་ནས་འོད་ཟེར་ཏིང་ངེ་འཛིན་ཐོབ་ནས། །
en: “Those who, in a single life, venerate as many guides As there are grains of sand in the Ganges Attain the utterly illuminating absorption

source: ཕྱིས་ནི་བྱང་ཆུབ་མྱ་ངན་མེད་རེག་འགྱུར། །
en: And subsequently reach awakening beyond anguish.

source: བྱང་ཆུབ་དྲི་མེད་བྱང་ཆུབ་ཆེ་ཐོབ་ནས། །ཆོས་ཀྱི་འཁོར་ལོ་དམ་པ་རབ་ཏུ་བསྐོར། །
en: “Having obtained immaculate awakening, great awakening, They will turn the sublime wheel of Dharma,

source: སེམས་ཅན་སངས་རྒྱས་བྱང་ཆུབ་མཆོག་བཞག་ནས། །ཆར་ཆུས་མེ་བསད་ལྟར་ནི་མྱ་ངན་འདའ། །
en: Whereby they will establish beings in the supreme awakening of buddhahood, Transcending anguish just as rainfall quenches flames.

source: རྐང་གཉིས་འདྲེན་པ་མི་འདུལ་ཁ་ལོ་སྒྱུར། །བསོད་ནམས་ཞིང་སྟེ་བསོད་ནམས་ཕུང་པོ་གཅིག །
en: “The guide of humans, the charioteer of humans, Is the single field of merit, the single mount of merit.

source: དེ་ལ་མི་ཡིས་དད་པ་ཙམ་བསྐྱེད་ན། །སྐད་ཅིག་གིས་ནི་མི་ཁོམ་ཐམས་ཅད་སྤོང་། །
en: If people simply develop faith toward that buddha, They will instantly discard all unfree states.

source: གང་ཞིག་བདེ་བར་གཤེགས་ཀྱི་མཚན་འདོན་པ། །མི་ལུས་རྙེད་པ་དལ་བ་གཅིག་ཐོབ་ནས། །
en: “Those who recite the name of this blissful one Will obtain human bodies and gain leisure.

source: མཐའ་ཡས་རྒྱ་མཚོ་དེ་བཞིན་གཤེགས་བཞུགས་ལ། །མི་ཡི་མཁས་པ་བསོད་ནམས་རབ་ཏུ་བྱེད། །
en: Then these wise persons will create merit In the limitless ocean wherein the thus-gone ones dwell.

source: སངས་རྒྱས་མཚན་ནི་སྟོང་ཕྲག་བརྒྱ་ཙམ་དུ། །གོམས་བྱེད་དེ་ནི་རྗེས་འཐུན་བཟོད་པ་ཐོབ། །
en: “Those who chant the name of this buddha A mere one hundred thousand times will attain concordant acceptance

source: ལྷ་ཡི་མིག་ཐོབ་ཇི་ལྟར་ང་ཡིས་ནི། །སངས་རྒྱས་མར་མེ་མཛད་མཐོང་མེ་ཏོག་གིས། །གཏོར་བ་བྱས་ནས་བཟོད་པ་ཐོབ་གྱུར་པ། །
en: And the attainment of the divine eye, just as I did. “When I saw the Buddha Dīpaṃkara I scattered flowers And thereby attained acceptance.

source: དེ་འདྲའི་བཟོད་པ་དག་ནི་ཐོབ་པར་འགྱུར། །
en: They will acquire that sort of acceptance.

source: འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་ཐུབ་པ་ཡི། །མཚན་ནི་ཐོས་ནས་
en: Upon hearing the name of this illuminating sage who protects the world.

source: སུ་ཞིག་ལུང་མི་ནོད། །གཞན་དུ་གང་ཞིག་མུ་སྟེགས་ཅན་གྱུར་པའམ། །ཕྲག་དོག་དག་གིས་ཉམས་པའི་མི་མ་གཏོགས། །
en: “Only those who are extremists, Or who suffer from jealousy Would not want teachings

source: འདྲེན་པ་སངས་རྒྱས་ཀྱི་ནི་མངོན་སུམ་དུ། །འདི་འདྲའི་མདོ་སྡེ་བཤད་པ་སུས་ཐོས་པ། །དེ་ནི་ཕྱི་དུས་དག་ཏུ་འདི་འཛིན་ཅིང་། །གཞན་དག་ལ་ཡང་རབ་ཏུ་སྟོན་པར་བྱེད། །
en: “Those who hear such a discourse taught Directly from the guide, the Buddha, Will remember it in the future And teach it to others.

source: གཞོན་ནུ་སྟེང་གི་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་གཞོན་ནུ་དཔེ་སྔ་མ་ལྟ་བུ་དེ་ལས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ
en: “Young man, located above this buddha realm, as in the previous analogy, past as many realms as there are grains of sand in the Ganges, there is a world called Wide Open.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྩོན་འགྲུས་གྲངས་མེད་པས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བ་ཞིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There the thus-gone, worthy, perfect Buddha Stable in Immeasurable Diligence lives. He is alive and well and teaches the Dharma.

source: གཞོན་ནུ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་གྲངས་མེད་པས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བ་དེའི་མཚན་ཐོས་ནས་
en: Young man, when those noble sons or daughters who abide in the Great Vehicle hear the name of the thus-gone one Stable in Immeasurable Diligence—

source: སོམ་ཉི་མི་ཟ་ལ་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན། དེ་ཚེ་འདས་པའི་འོག་ཏུ་ནམས་ཀྱང་བརྩོན་འགྲུས་དམན་པར་མི་འགྱུར།
en: as long as they do not doubt this but trust in my vision—their diligence will never decrease once they have passed away.

source: ནམས་ཀྱང་འདོད་པ་ལ་སྟེན་པར་མི་འགྱུར།
en: Never again will they indulge in desire.

source: ནམས་ཀྱང་མའི་སྡུག་བསྔལ་གྱིས་གོས་པར་མི་འགྱུར།
en: Never again will they be stained by the suffering of a mother.

source: ཕའི་སྡུག་བསྔལ་དང་། གཉེན་གྱི་སྡུག་བསྔལ་དང་། སྤུན་གྱི་སྡུག་བསྔལ་གྱིས་གོས་པར་མི་འགྱུར།
en: Never again will they be stained by the suffering of a father, relative, and friend.

source: སྲིང་མོའི་སྡུག་བསྔལ་གྱིས་གོས་པར་མི་འགྱུར།
en: Never will they be stained by the suffering of a sister.

source: ནམས་ཀྱང་མཛའ་བོ་དང་། བཤེས་གཉེན་དང་། བློན་པོ་དང་། སྣག་གི་གཉེན་མཚམས་ཀྱི་སྡུག་བསྔལ་གྱིས་གོས་པར་མི་འགྱུར།
en: Never again will they be stained by the suffering of a companion, ally, clansman, or kinsman.

source: ནམས་ཀྱང་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་མ་བརྒྱན་པར་མི་འགྱུར།
en: Never will their bodies not be adorned by the thirty-two marks of a great being.

source: ནམས་ཀྱང་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་མང་བར་མི་འགྱུར།
en: Never again will their attachment, aggression, and ignorance increase.

source: ནམས་ཀྱང་ནད་མང་བར་མི་འགྱུར།
en: Never again will any diseases proliferate.

source: ནམས་ཀྱང་མྱ་ངན་མང་བར་མི་འགྱུར།
en: Never again will any anguish grow.

source: བདེ་བ་མཐའ་ཡས་པ་ཡོངས་སུ་བཟུང་བར་འགྱུར།
en: Instead, they will gain limitless happiness.

source: བྱང་ཆུབ་ལ་ཐུག་གི་བར་དུ་ཡོན་ཏན་མཐའ་ཡས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པས་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །
en: On the way to awakening, they will gain countless trillions of limitless virtues.”

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མི་ཟ་བ། །ནམས་ཀྱང་ཕ་མ་གཉེན་འདུན་གྱི། །ཚོགས་ཀྱི་སྡུག་བསྔལ་མི་མཐོང་ངོ་། །
en: “Those who hear the name of this world protector And do not doubt it Will never have to witness The suffering of parents and many relatives.

source: སྟེང་གི་ཕྱོགས་ན་རྐང་གཉིས་མཆོག །འཇིག་རྟེན་སྣང་བར་མཛད་པ་བཞུགས། །
en: “Above us abides the supreme human, Who illuminates the world.

source: སྲིད་གསུམ་གསལ་བར་མཛད་ནས་སུ། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: He illuminates the three realms of existence And teaches beings the Dharma.

source: རྫོགས་སངས་རྒྱས་པའི་མཚན་ཐོས་ནས། །དེ་ནི་གཞན་རྣམས་རབ་བསྟན་ན། །
en: “Those who hear the name of this perfect buddha And teach it to others

source: རྟག་ཏུ་སུམ་ཅུ་རྩ་གཉིས་ཀྱི། །མཚན་དག་གིས་ནི་བརྒྱན་པར་འགྱུར། །
en: Will be perennially adorned With the thirty-two marks.

source: གང་ཞིག་ཐུབ་པའི་མཚན་འཛིན་ན། །
en: “Those who remember the name of this sage

source: དེ་ནི་ཤེས་རབ་མི་ཉམས་ཤིང་། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་མཆོད། །
en: Will not have their insight impaired. When they are engaged in the practices of awakening, They will venerate the bodhisattvas as well.

source: སངས་རྒྱས་ཀྱི་ནི་མཚན་བསྟན་པས། །ཕྱིས་ནི་བྱང་ཆུབ་སྤྱོད་པ་ན། །
en: “By teaching this buddha’s name, When later they practice for awakening,

source: སངས་རྒྱས་བྱེ་བ་བསམ་མི་ཁྱབ། །ཤེས་རབ་ཅན་གྱིས་རྟག་མཆོད་འགྱུར། །
en: These insightful ones shall constantly venerate Inconceivable millions of buddhas.

source: སངས་རྒྱས་མཚན་དེ་གང་ཐོས་ནས། །གཞན་རྣམས་ལ་ཡང་རབ་སྟོན་ན། །
en: “Those who hear the name of this perfect buddha And then reveal it to others

source: དེ་འདྲའི་བསོད་ནམས་ཕུང་པོ་ཡི། །ཚད་ནི་བཤད་པར་མི་ནུས་སོ། །
en: Will obtain a mass of merit The measure of which is impossible to describe.

source: དེ་ལྟར་མཚན་འདི་ཐོས་པ་ནི། །ཕྱི་དུས་དག་ནི་མང་པོར་ཡང་། །བླ་མེད་སངས་རྒྱས་ཡེ་ཤེས་ལ། །དེར་ནི་སོམ་ཉི་ཟ་མི་བྱེད། །
en: “Those who hear this name Shall never come to doubt— Even for the longest time in the future— The unsurpassed wisdom of buddhahood.

source: གང་གིས་རྫོགས་སངས་རྒྱས་མཐོང་ནས། །བཀུར་སྟི་རིམ་གྲོ་བྱས་པ་ནི། །ཕྱི་མའི་དུས་སུ་མདོ་སྡེ་འདི། །དེ་ཡི་ལག་ཏུ་འཐོབ་པར་འགྱུར། །
en: “Those who see this perfect buddha And render service and honor unto him Shall receive this discourse In their hands at a future time.

source: ང་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཡིས། །བསྐོར་དང་དྲ་བ་ཅན་སུས་མཐོང་། །
en: “Those who see me surrounded by bodhisattvas, As well as Ratnajālin,

source: དེས་ནི་མདོ་སྡེ་འདི་ཐོས་ནས། །དེ་ལ་སོམ་ཉི་ཟ་མི་འགྱུར། །
en: And hear this discourse Will not come to doubt it.

source: དེ་བཞིན་གཤེགས་པ་དཔག་མེད་དེ། །སངས་རྒྱས་ཆོས་ལ་ཐེ་ཙོམ་སྤངས། །
en: “They will abandon any doubt In the boundless thus-gone ones and their buddha qualities.

source: འདི་ལྟར་སྔོན་གྱི་སྤྱོད་པ་ནི། །བསྐལ་པ་བྱེ་བ་མང་བརྒྱར་སྤྱད། །
en: They will continue their earlier practices For many billions of eons.

source: ལག་པ་རྐང་པ་གཏོང་བ་དང་། །རྣ་བ་སྣ་དང་མགོ་བོ་དང་། །བུ་ཕོ་བུ་མོ་ཡུལ་འཁོར་དག །བྱིན་ལ་ཡིད་ནི་མི་དགའ་མེད། །
en: “They will give up their hands and legs And give away their ears, noses, heads, Sons, daughters, and subjects Without any displeasure.

source: གང་ཞིག་མདོ་སྡེ་འདི་ཐོས་པ། །ཕྱི་མའི་དུས་ན་རྙེད་ནས་ནི། །གཞན་དག་ལ་ཡང་སྟོན་བྱེད་ན། །དེ་ནི་མཆོད་པའི་འོས་སུ་འགྱུར། །
en: “When those who hear this discourse Come in contact with it in the future, They shall teach it to others, And so become worthy of veneration.

source: སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་བ། །མངོན་རྫོགས་བྱང་ཆུབ་འདོད་གང་གིས། །ནམ་ཡང་འཇིག་རྟེན་མགོན་པོ་ཡི། །བསྟན་ལ་སོམ་ཉི་མ་ཟ་ཅིག །
en: “Let those who desire complete awakening, Which is the domain of all the buddhas, Never doubt the teachings Of the world protector!

source: དེ་ལྟར་མདོ་སྡེ་འདི་ཐོས་ནས། །གཡོ་སྒྱུ་མེད་པའི་མིས་ཟུང་ལ། །
en: “Those who have heard this discourse Must uphold it free from deceit.

source: འཆག་པ་དག་ཏུའང་ཡང་དང་ཡང་། །མདོ་སྡེ་འདི་ནི་བརྗོད་པར་བགྱི། །
en: They should preach this discourse again and again, Wherever they may go.

source: བརྗོད་བྱས་ཟླ་བ་གསུམ་དག་ཏུ། །ཚང་བར་ཤིན་ཏུ་ཡང་བརྗོད་ན། །
en: “If they can perfect the meaning of this discourse, Entirely within three months,

source: ཆོས་རྣམས་ཐམས་ཅད་འཛིན་བྱེད་པའི། །གཟུངས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར། །
en: They shall attain the wisdom of recall That recollects all teachings.”

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་གསུངས་པར་རིག་ནས་རིན་ཐང་མེད་པའི་རས་བཅོས་བུ་གསེར་གྱིས་བརྒྱན་པ་ཟུང་གཅིག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གསོལ་ཏོ། །
en: Once the Young Licchavi Ratnajālin had heard these well-spoken teachings of the Blessed One, he draped the Blessed One in priceless fabrics ornamented with gold.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་ཇི་ལྟ་བུས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ཐམས་ཅད་ཀྱི། བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་འོད་ཟེར་དག་བྱུང་སྟེ།
en: Then the Blessed One performed a miracle such that from every pore of the Blessed One’s body, light streamed forth,

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྣང་བར་གྱུར་པ་དང་།
en: illuminating all the countless, infinite worlds in the east.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་གང་དག་སྐྱེས་པ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་མཐོང་བ་དང་།
en: All the beings born in those buddha realms beheld this buddha realm, and

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་སེམས་ཅན་གང་དག་འདུས་པ་དེ་དག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་མཐོང་བ་དང་།
en: all the beings gathered in the Thus-Gone One’s assembly in this buddha realm also beheld this buddha realm.

source: དེའི་ཚེ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དགུ་བཅུ་རྩ་དགུ་སྙེད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཁོར་བཞི་པོ་ལ་སྣང་བར་གྱུར་པ།
en: At that moment as many blessed buddhas, including their fourfold assemblies, were illuminated as ninety-nine times the number of grains of sand in the Ganges.

source: དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པས་མངོན་པར་འདུ་མཛད་དོ། །
en: Such was the miracle that he performed.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then asked the young Licchavi Ratnajālin,

source: གཞོན་ནུ་ཁྱོད་ཀྱིས་སྟེང་གི་ཕྱོགས་ལོགས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདི་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པ། འདི་ལྟར་གཞལ་གྱིས་མི་ལང་བ། འདི་ལྟར་ཐུག་པ་མེད་པ། འདི་ལྟར་ཚད་མེད་པ། འདི་ལྟར་བརྗོད་ཀྱིས་མི་ལང་བ་དེ་དག་མཐོང་ངམ།
en: “Young man, when you look above, do you see all the blessed buddhas, who are so unfathomably, innumerably, limitlessly, immeasurably, and indescribably many?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Blessed One, I see them.

source: བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ། །
en: Blissful One, I see them.”

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ལྷ་དང་མི་རྣམས་ཀྱི་མིང་གི་ཚོགས་པས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཚན་ཆེས་མང་སྟེ།
en: “Noble son, the names of these thus-gone ones vastly outnumber the names of the gods and humans gathered in the worlds of the great trichiliocosm.

source: རེ་རེ་ལ་ཡང་མཚན་གྱི་ཚོགས་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོད་དེ།
en: Each of them has an inconceivable and boundless agglomeration of names.

source: འདི་ལྟར་ཤར་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ལེགས་པར་རབ་ཏུ་ཞི་བའི་དཔལ་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་དཀྱིལ་འཁོར་རྣམ་དག་ཅེས་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་འོད་ཀྱིས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་རྒྱས་པ་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་ཟེར་ཟླ་བས་བརྒྱན་པ་མཁས་པའི་གཟི་བརྗིད་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་རྣམས་ཏེ།
en: This also applies to the thus-gone one Majestic King with the Elegant Peaceful Voice in the east, and likewise to the thus-gone one Pure Moon Disk, the thus-gone one King of Knowledge of Floral Light Displays, the thus-gone one King of Blossoming Sal Tree Flowers, and the thus-gone one Majestic King with the Splendorous Voice of Learning Adorned by Precious Moonlight.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་མཚན་ཇི་ལྟ་བར་དེ་བཞིན་གཤེགས་པ་སོ་སོའི་མཚན་ཡང་དེ་དང་འདྲ་བར་མཐོང་ངམ།
en: Just as it is with the name of a single thus-gone one, so it is with that of any thus-gone one. Do you see that?”

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། དེ་བཞིན་དུ་འོག་གི་ཕྱོགས་དང་། དེ་བཞིན་དུ་སྟེང་གི་ཕྱོགས་ཏེདེ་ལྟར་ཕྱོགས་བཅུ་ཀུན་གྱི་ཕྱོགས་རེ་རེ་ན་དེ་བཞིན་གཤེགས་པའི་མཚན་གཅིག་པ་ཡང་གྲངས་མ་མཆིས་ལ། དེ་བཞིན་གཤེགས་པའི་མཚན་ཐ་དད་པ་ཡང་བཞུགས་སོ། །
en: So it is in the south, in the west, in the north, below, and above—in each of the ten directions there are countless names of the individual thus-gone ones and myriad different names of the thus-gone ones.”

source: གཞོན་ནུ་ཁྱོད་ཀྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་གནས་པ་དེ་བས་ཀྱང་ཆེས་ལྷག་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་མཐོང་ངམ།
en: “Young man, do you see how the blessed buddhas vastly exceed those who abide in the realm of a universal monarch?”

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་མགུ་ཞིང་དགའ་ལ་ཡི་རངས། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་
en: The young Licchavi Ratnajālin became pleased, delighted, joyful, and happy.

source: དེའི་ཚེ་ས་ཆེན་པོ་གཡོས་པར་གྱུར་ཏོ། །
en: At that moment when he was happy and delighted the earth quaked.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་སྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རབ་ཏུ་དགའ་བ་དང་། དགེ་བའི་རྩ་བ་སྐྱེད་པའི་སྣང་བ་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ། །
en: A great burst of light appeared that benefitted all beings, brought them happiness, pleased their minds, and aroused roots of virtue in them.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་ནམ་མཁའ་ལ་འཁོད་ནས། ལྷའི་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་ཕྱེ་མ་རྣམས་གཏོར་ཏོ། །
en: Trillions of gods stationed in the sky cast down powdered gold from the divine Jambu River.

source: ཚངས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་ལྷའི་ཙན་དན་དམར་པོའི་ཕྱེ་མ་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་གཏོར། མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། །
en: Trillions of brahmā gods tossed, scattered, and sprinkled divine red sandalwood powder upon the Blessed One.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོས་གཏོར། མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། །
en: Trillions of gods tossed, scattered, and sprinkled divine blue, pink, red, and white lotuses, as well as smaller and larger māndārava flowers.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་རིན་པོ་ཆེའི་གདུགས་སྟོང་ཕུལ་ལོ། །
en: Trillions of gods offered thousands of jeweled parasols.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ངུས་ཏེ། གནས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་རྗེས་སུ་དྲན་ནོ། །
en: Trillions of gods wept as they bowed their heads to the Blessed One’s feet, recalling trillions of their past lives.

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཀྱང་ཆོ་འཕྲུལ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་རབ་ཏུ་བསྟན་ཏོ། །
en: It was the blessings of the Blessed Buddha that allowed these trillions of miracles to occur.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: About this, it was said,

source: བྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་ཡི། །ལྷ་རྣམས་ཁོ་ར་ཁོར་ཡུག་ནས། །ཙན་དན་དམར་པོ་ཞིབ་མོ་ཡིས། །རྫོགས་སངས་རྒྱས་ལ་འཐོར་བར་བྱེད། །
en: Billions of gods Stationed in the periphery Tossed fine red sandalwood powder Upon the perfect Buddha.

source: བརྒྱ་བྱིན་བྱེ་བ་ཕྲག་སྟོང་དག །མཁའ་ལ་གནས་ནས་འཛམ་བུ་ཡི། །ཆུ་བོའི་གསེར་ཕྱེ་མང་པོ་ཡིས། །དེ་བཞིན་གཤེགས་ལ་འཐོར་བར་བྱེད། །
en: Tens of billions of śakra gods Stationed in the sky Tossed much powdered gold from the Jambu River Upon the Thus-Gone One.

source: ཚངས་པ་བྱེ་བ་ཉེར་ལྷགས་ནས། །ཙན་དན་དམར་པོའི་ཕྱེ་མ་ཡིས། །རྫོགས་སངས་རྒྱས་ལ་འཐོར་བྱེད་ཅིང་། །སྒྲ་དབྱངས་སྙན་པ་ཀུན་དུ་སྒྲོགས། །
en: Ten million brahmā gods arrived And tossed powdered red sandalwood Upon the perfect Buddha And sang melodious songs.

source: དྲི་མ་མེད་པའི་འོད་རིག་ནས། །ནམ་མཁའ་ལ་ནི་ལྷ་འཁོད་དོ། །
en: Seeing the immaculate light, The gods arrayed themselves in the sky.

source: གླུ་དབྱངས་དཔག་ཏུ་མེད་པ་ལེན། །
en: They sang countless songs And

source: མཁའ་ལ་རས་ཀྱིས་གཡོབ་པར་བྱེད། །
en: waved fabrics in the sky.

source: ནམ་མཁའ་ལ་ནི་ལྷ་འཁོད་དེ། །པད་མ་བརྒྱ་ཕྲག་སྟོང་བླངས་ནས། །
en: The gods arrayed in the sky, Holding thousands of lotus flowers,

source: འཇིག་རྟེན་གསལ་ལ་སྟོན་བྱེད་ཅིང་། །རྒྱལ་མཚན་ལ་སོགས་མཆོད་པ་བྱེད། །
en: Displayed them to the World Illuminator And venerated him with banners and so forth.

source: ཟླ་མེད་རྒྱལ་མཆོག་ཐུབ་དབང་ལ། །རབ་ཏུ་ཡིད་དགས་ཕྱག་འཚལ་ཞིང་། །
en: With minds filled with joy, They honored the unparalleled supreme Victor, the Lord of Sages.

source: བསྟོད་བྱེད་ནོར་བུ་རིན་ཆེན་དང་། །མུ་ཏིག་རྒྱན་ཕྲེང་འཐོར་བར་བྱེད། །
en: They praised him and scattered upon him Garlands of precious jewels and pearls.

source: མི་ནི་བྱེ་བ་འབུམ་ཐམ་པ། །རྒྱལ་མཆོག་ཟླ་མེད་པ་ལ་མཆོད། །
en: A trillion people Venerated the unparalleled supreme Victor.

source: སྔོན་གྱི་གནས་བརྒྱ་རྗེས་དྲན་ཞིང་། །ཐུབ་མཆོག་བླ་མེད་མགོས་ཕྱག་འཚལ། །
en: They remembered hundreds of their past lives And bowed their heads to the unparalleled Lord of Sages.

source: དེ་ནས་འཇིག་རྟེན་སྣང་མཛད་པས། །ཆོས་ཀྱི་རྔ་ནི་རབ་བརྡུངས་ཏེ། །
en: Then, the World Illuminator Beat the Dharma drum;

source: དེ་ཡིས་སྒྲས་ནི་ཞིང་རབ་མང་། །བྱེ་བ་དག་ཏུ་གོ་བར་བྱས། །
en: Its sound was heard throughout many billions Of buddha realms.

source: དེ་ཡི་ཚེ་ན་སེམས་ཅན་ནི། །བྱེ་བ་གྲངས་མེད་ཀུན་ནས་ལྷགས། །
en: At that moment, Countless millions of beings arrived from all directions.

source: དེ་དག་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། །སངས་རྒྱས་ཡེ་ཤེས་བླ་མེད་བཀོད། །
en: They were established in the wisdom of buddhahood By the perfect Buddha.

source: དེ་ཚེ་གཞོན་ནུ་དགའ་གྱུར་ནས། །
en: The young man was delighted;

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ཡི། །གདན་འབུལ་རིན་ཆེན་ཕྱེ་མ་ཡིས། །གཞོན་ནུ་སངས་རྒྱས་གཙོ་ལ་མཆོད། །
en: He offered a seat of uraga sandalwood And venerated the supreme Buddha With powdered gems.

source: ནོར་བུ་རིན་ཆེན་འོད་གཅིག་ནི། །འཇིག་རྟེན་སྟོང་དུ་གཏོང་བར་བྱེད། །
en: The light of one precious gem Shone throughout thousands of worlds.

source: རིན་ཆེན་གཅིག་ལས་འོད་ཟེར་ནི། །སྟོང་ཕྲག་བྱེ་བར་གཏོང་བར་བྱེད། །
en: The light of that single gem Radiated throughout billions of worlds.

source: དེ་བཞིན་རིན་ཆེན་མ་ལུས་ལས། །འོད་ཟེར་དག་ནི་བྱུང་བར་གྱུར། །
en: In the same way, light sprang forth From every gem without exception.

source: དེ་དག་གིས་ནི་དེ་ཡི་ཚེ། །ཡངས་པ་ཅན་ཡང་སྣང་བར་བྱས། །
en: At that moment, they also Illuminated Vaiśālī.

source: རིན་ཆེན་རྣམ་པ་དེ་སྙེད་ཀྱིས། །སངས་རྒྱས་གཙོ་ལ་མཆོད་བྱེད་ཅིང་། །
en: All of these gems were used To venerate the principle Buddha.

source: རིན་པོ་ཆེ་ཡི་ཕུང་པོ་ཡང་། །ཐུབ་པ་ཆེ་ལ་འབུལ་བར་བྱེད། །
en: A great pile of gems Also was offered to the Great Sage.

source: གདུགས་ནི་གང་དག་མུ་ཁྱུད་བྱས། །མུ་ཏིག་ཕྲེང་གིས་ཡོངས་བརྒྱན་པ། །
en: Parasols adorned With pearl garlands surrounded him.

source: རེ་རེ་ལ་ཡང་མུ་ཁྱུད་ཅན། །སྟོང་ཕྲག་ཉི་ཤུ་རྩ་ལྔའོ། །
en: Each had twenty-five thousand Surrounding layers.

source: འདི་འདྲའི་ལེགས་པ་དེ་ཡིས་ནི། །ཐུབ་པ་ཆེ་ལ་མཆོད་པ་བྱས། །
en: They venerated the Great Sage Through such excellent means.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ། །གསེང་ཐགས་ཀྱི་ནི་གོས་ཕུལ་ལོ། །
en: Woven fabrics were offered To all the bodhisattvas.

source: བྱང་ཆུབ་ཤིང་དག་སྤྲུལ་ནས་སུ། །དེའི་དྲུང་སེང་གེའི་ཁྲི་བཤམས་ལ། །
en: Lion thrones were placed Before emanated trees of awakening.

source: སྟོང་ཕྲག་བྱེ་བ་ཉི་ཤུ་ལྔ། །དེ་རྣམས་ལ་ནི་འཁོད་གྱུར་པ། །
en: All told, two hundred fifty million Were set out.

source: ལོ་ནི་བྱེ་བ་གྲངས་སྙེད་པར། །བགྲང་བ་དག་ཏུ་མི་ཆོད་པའི། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི། །བྱེ་བ་བརྒྱ་ཕྲག་ལྷགས་པར་གྱུར། །
en: For millions of years, Countless bodhisattvas— Hundreds of millions in fact— Arrived there.

source: ཤར་གྱི་ཕྱོགས་ནས་བཟུང་ནས་སུ། །ལྷོ་ཕྱོགས་ནུབ་ཕྱོགས་བྱང་ཕྱོགས་དང་། །འོག་དང་སྟེང་དང་དེ་བཞིན་དུ། །ཕྱོགས་དག་གི་ཡང་མཚམས་ནས་ལྷགས། །
en: They arrived first from the east, And then from the south, west, and north, From above and below, And from the intermediate directions.

source: ཇི་ཙམ་མིག་གིས་མཐོང་བའི་བར། །དེ་སྲིད་འཇིག་རྟེན་ཁམས་རྣམས་སུ། །སྐྱོབ་པ་འཇིག་རྟེན་མགོན་པོ་ཡི། །གསེར་གྱི་མདོག་འདྲའི་འོད་ཀྱིས་གང་། །
en: The golden-colored light Of the Refuge, the World Protector, Filled as many realms As the eye could see.
